#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
digitalocean_certificate.www: Refreshing state... [id=2a3f2ccc-c5f8-4b24-8c37-c53714de02e5]
digitalocean_spaces_bucket.taccoform-blog: Refreshing state... [id=taccoform-blog]
digitalocean_droplet.web[0]: Refreshing state... [id=225609967]
digitalocean_loadbalancer.web: Refreshing state... [id=b3bd9bce-9c92-43a3-b0e5-16cb81c8e206]
digitalocean_record.www: Refreshing state... [id=125812714]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # digitalocean_certificate.www will be created
  + resource "digitalocean_certificate" "www" {
      + domains          = [
          + "www.taccoform.com",
        ]
      + id               = (known after apply)
      + name             = "www"
      + not_after        = (known after apply)
      + sha1_fingerprint = (known after apply)
      + state            = (known after apply)
      + type             = "lets_encrypt"
    }

  # digitalocean_loadbalancer.web will be updated in-place
  ~ resource "digitalocean_loadbalancer" "web" {
        id                       = "b3bd9bce-9c92-43a3-b0e5-16cb81c8e206"
        name                     = "web-lb"
        # (10 unchanged attributes hidden)

      - forwarding_rule {
          - certificate_id  = "c8014949-cd68-425f-8300-6dfa5bae3177" -> null
          - entry_port      = 443 -> null
          - entry_protocol  = "https" -> null
          - target_port     = 80 -> null
          - target_protocol = "http" -> null
          - tls_passthrough = false -> null
        }
      - forwarding_rule {
          - certificate_id  = "c8014949-cd68-425f-8300-6dfa5bae3177" -> null
          - entry_port      = 80 -> null
          - entry_protocol  = "http" -> null
          - target_port     = 80 -> null
          - target_protocol = "http" -> null
          - tls_passthrough = false -> null
        }
      + forwarding_rule {
          + certificate_id  = (known after apply)
          + entry_port      = 443
          + entry_protocol  = "https"
          + target_port     = 80
          + target_protocol = "http"
          + tls_passthrough = false
        }
      + forwarding_rule {
          + certificate_id  = (known after apply)
          + entry_port      = 80
          + entry_protocol  = "http"
          + target_port     = 80
          + target_protocol = "http"
          + tls_passthrough = false
        }


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @jperez3, Action: `pull_request`*